package main

// Домашнє завдання по інтерфейсах:
// кожна тварина в залежності від свого типу споживає різку кількість
// кілограмів їжі на місяць
// -- собака - їсть 10кг/мес корму на кожні 5кг власної ваги
// -- кішка - 7кг/мес на кожен кілограм власної ваги
// -- корова - 25кг/мес на кожен кілограм власної ваги
// на фермі може бути різна кількість собак, кішок та корів
// кажен тип тварини має сам розраховувати для себе вагу корму
// написати динамічну функцію,
// 1) яка буде виводити в консоль для кожної тварини на фермі її назву,
// 2) вагу, та скільки їжі треба для того щоб її прогодувати
// 3) ця функція також моє повертати сумму кг корму на всю ферму для
// подальшого виводу у консоль
